#pragma once
#include"BaseEnemy.h"

//****************************************************************
// 
// テストとサンプルを兼ねた敵の派生クラス 
// 
//****************************************************************

class TestEnemy final:public BaseEnemy
{
    //****************************************************************
    // 
    // 関数
    // 
    //****************************************************************
public:
    
    TestEnemy(ID3D11Device* pDevice_, 
        DirectX::XMFLOAT3 EmitterPoint_/*スポーン位置*/);

    void fInitialize() override;
    void fUpdate(float elapsedTime_) override;

    //****************************************************************
    // 
    // 変数 
    // 
    //****************************************************************
private:
    int State{}; // 状態
};
